In [16]:
import numpy as np
import pandas as pd

In [17]:
type(np.nan)
vals2 = np.array([1,3,np.nan, 4])
vals2.dtype

dtype('float64')

In [18]:
1+np.nan
print(np.sum(vals2), np.nansum(vals2))

nan 8.0

In [20]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [22]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [25]:
data.dropna()

0        1
2    hello
dtype: object

In [27]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [35]:
df.dropna(axis=0)

     0    1  2
1  2.0  3.0  5

In [37]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [40]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [41]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [45]:
df.dropna(axis='rows', thresh=3) #как минимум 3 нормальных числа

     0    1  2   3
1  2.0  3.0  5 NaN

In [47]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [85]:
df[4] = [i**2 for i in range(1,4)]
df

     0    1  2   3  4
0  1.0  NaN  2 NaN  1
1  2.0  3.0  5 NaN  4
2  NaN  4.0  6 NaN  9

In [87]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [89]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [95]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [97]:
df

     0    1  2   3  4
0  1.0  NaN  2 NaN  1
1  2.0  3.0  5 NaN  4
2  NaN  4.0  6 NaN  9

In [104]:
df.fillna(method='bfill', axis=1)

     0    1    2    3    4
0  1.0  2.0  2.0  1.0  1.0
1  2.0  3.0  5.0  4.0  4.0
2  4.0  4.0  6.0  9.0  9.0